In [2]:
import pandas as pd
import numpy as np

In [3]:
age = np.random.randint(18,80,30)

In [4]:
s = pd.Series(age)

In [6]:
s[:5]

0    32
1    62
2    64
3    51
4    51
dtype: int32

In [7]:
s.head()

0    32
1    62
2    64
3    51
4    51
dtype: int32

In [8]:
s.tail()

25    27
26    24
27    71
28    41
29    52
dtype: int32

In [14]:
data = {
    "names" : ["Ram","Shyam","Manoj","Shivam","Mukul","Ramesh"],
    "marks" : [78,76,88,56,80,63],
    "grades" : ['A','A+','A+','B','A+','B'],
    "hobby" : ['Swimming','Cricket','Cricket',None,'Chess','Swimming']
}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

    names  marks grades     hobby
0     Ram     78      A  Swimming
1   Shyam     76     A+   Cricket
2   Manoj     88     A+   Cricket
3  Shivam     56      B      None
4   Mukul     80     A+     Chess
5  Ramesh     63      B  Swimming

In [17]:
df.columns

Index(['names', 'marks', 'grades', 'hobby'], dtype='object')

In [18]:
df.shape

(6, 4)

In [21]:
df[df['marks'] >= 80]

   names  marks grades    hobby
2  Manoj     88     A+  Cricket
4  Mukul     80     A+    Chess